app/sidekiq/summarize_search_job.rb

  def perform(search_query_id)
    search_query = SearchQuery.find_by(id: search_query_id)
    return unless search_query

    ip = search_query.ip_address
    query = search_query.query.strip.downcase

    return unless query.present? && query.include?(" ") && query.length > 5

    SearchSummary.transaction do
      existing_summaries = SearchSummary.where(ip_address: ip)

      existing_summaries.each do |summary|
        existing_query = summary.query

        if query.include?(existing_query)
          summary.destroy
          next
        end

        if existing_query.include?(query)
          return
        end
      end

      summary = SearchSummary.lock.find_or_initialize_by(ip_address: ip, query: query)
      summary.search_count ||= 0
      summary.search_count += 1
      summary.last_searched_at = Time.current
      summary.save!
---
SELECT "search_queries".* FROM "search_queries" WHERE "search_queries"."id" = 93 LIMIT 1
SELECT "search_summaries".* FROM "search_summaries" WHERE "search_summaries"."ip_address" = '127.0.0.1' AND (LENGTH(query) < 7)
SELECT "search_summaries".* FROM "search_summaries" WHERE "search_summaries"."ip_address" = '127.0.0.1' AND "search_summaries"."query" = 'there i' LIMIT 1 FOR UPDATE
UPDATE "search_summaries" SET "search_count" = 3, "last_searched_at" = '2025-04-14 07:39:43.878204', "updated_at" = '2025-04-14 07:39:43.895747' WHERE "search_summaries"."id" = 64