app/controllers/searches_controller.rb

  def create
    query = params[:query]&.strip
    return head :bad_request if query.blank?

    ip_address = request.remote_ip
    search_query = SearchQuery.create!(query: query, ip_address: ip_address)
---
INSERT INTO "search_queries" ("query", "ip_address", "created_at", "updated_at") VALUES ('he', '127.0.0.1', '2025-04-13 11:52:35.428870', '2025-04-13 11:52:35.428870') RETURNING "id"

  def analytics
    summaries = SearchSummary.where(ip_address: request.remote_ip)
                              .order(search_count: :desc, last_searched_at: :desc)
                              .limit(10)
    render json: summaries.map { |s| { query: s.query, count: s.search_count, last_searched: s.last_searched_at } }
---
SELECT "search_summaries".* FROM "search_summaries" WHERE "search_summaries"."ip_address" = '127.0.0.1' ORDER BY "search_summaries"."search_count" DESC, "search_summaries"."last_searched_at" DESC LIMIT 10
SELECT "search_summaries".* FROM "search_summaries" WHERE "search_summaries"."ip_address" = '127.0.0.1' AND (query LIKE 'hello%') AND (LENGTH(query) < 5) ORDER BY "search_summaries"."created_at" DESC LIMIT 5